more/rails/sample_app/app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$8Q8U7cXOEqSFiRWdLjil.egOBj6xg8lfmCylX1zuAiVZE4pU/R.pm"], ["updated_at", "2017-09-09 12:01:50.552095"], ["id", 989720851]]
---
  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render "edit"
    elsif @user.update_attributes(user_params)